const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', () => {
  expect(sum(1, 2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', () => {
  expect(sum(20, 1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7', () => {
  expect(sum(2, 5)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
test('10 + 25 เท่ากับ 35', () => {
  expect(sum(10, 25)).toBe(35);
});

test('11 + 22 เท่ากับ 33', () => {
  expect(sum(11, 22)).toBe(33);
});

test('100 + 200 เท่ากับ 300', () => {
  expect(sum(100, 200)).toBe(300);
});